---
kind: property
id: P:Autodesk.Revit.DB.NumberSystem.NumberOrientation
source: html/735f0f87-74d8-826e-72e5-564e6114dd0c.htm
---
# Autodesk.Revit.DB.NumberSystem.NumberOrientation Property

The number orientation of number system.

## Syntax (C#)
```csharp
public TagOrientation NumberOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: Orientation AnyModelDirection is not supported
 -or-
 When setting this property: A value passed for an enumeration argument is not a member of that enumeration